quizeo_app/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "zane"], ["LIMIT", 1]]
---
  def to_token_payload
    # Returns the payload as a hash
    user = User.find_by username: username