quizeo_app/app/controllers/answers_controller.rb

SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def create
    if params[:user_id]
      @answer = Answer.find(answer_params[:id])
      @user = User.find(params[:user_id]).answers << @answer