quizeo_app/app/controllers/playlists_controller.rb

  def index
    @playlists = Playlist.all
---
SELECT "playlists".* FROM "playlists"

  def show
    @playlist = Playlist.where(id: params[:id])
---
SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = $1  [["id", 23]]

  def destroy
    @playlist = Playlist.find(params[:id])
    @playlist.destroy
---
SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
DELETE FROM "playlists" WHERE "playlists"."id" = $1  [["id", 11]]